{
  "title": "Micro Frontends in Action: Architecture and Integration Approaches <1>{{currentDate}}</1>",
  "content": "A good frontend is tough to develop, but scaling frontend development for several teams to work at the same time on a large and complex project is even tougher. In this blog, we will understand the current trend of breaking frontend monoliths into multiple smaller, manageable, and independent pieces and how the micro frontend architecture approach can help operation managers to improve the efficiency and effectiveness of their team working on frontend code. Apart from this, we will also discuss different ways to integrate this architecture into the frontend.\n\nWhat are Micro Frontends?\nIn recent years, microservices popularity has incredibly increased. Many organizations have adopted microservices as their application’s architectural style to break free from large, monolithic backends. It has been labelled as server-side architecture and many companies struggle with monolithic frontends.\n\nMaybe you want to develop a progressive web application and use JavaScript language features but can’t find an easy place or the needed build tools in your existing build process. Or perhaps you want to scale deployment so that multiple teams can work simultaneously but the complexity and coupling of monolithic applications make it impossible to do so.\n\nHence, attention is being paid to the overall organization and architecture structures required for modern, complex web applications development. Now we are seeing patterns arising for breaking frontend monoliths into smaller, uncomplicated pieces that can be developed, deployed, and tested independently, while still emerging as a single cohesive product. And this technique is what we refer to as Micro frontends.\n\nA micro frontend architecture is a style of architecture that combines independently developed front-end applications into a larger whole. The term micro frontend first arrived in ThoughtWorks Technology Radar, 2016. Simply put, a micro frontend extends the microservice architecture into the frontend world.\n\nThe idea behind micro frontend is to think of a web application or website as a blend of features owned by independent development teams where each team has a different mission it handles and specialises in. In a micro frontend architecture, a team is considered to be cross-functional that develops its features from databases to user interfaces.",
  "source": "Source"
}
